{
    "offer": {
      "offer_title": "Engineering Manager (JavaScript/SAP Hybris)",
      "company": "GPC GLOBAL TECHNOLOGY CENTER",
      "salary": " salary not specified ",
      "contract": "contract of employment (full-time)",
      "location": "hybrid work - Kraków, Grzegórzki",
      "experience": "manager",
      "expected_technologies": "JavaScript, SAP Hybris",
      "optional_technologies": "N/A",
      "offer_content": "\nAbout the project: \nThis is an engineering leadership role with responsibility for implementing the technology strategy and execution for our digital platforms (e-commerce) that align with our product strategy and meet our business goals.\nShe/He must exhibit a deep understanding of modern technology stack and agile delivery models, demonstrate the focus on customer experience, and must have a proven record of accomplishment of modern software development and delivering strategic solutions.\nClose collaboration and alignment with a wide variety of both internal stakeholders and external vendors will be required.  As such, exceptional abilities in building and maintaining strong working relationships and organizational savvy will be required.  High-level communication and presentation skills are required. The ability to attract, retain, and develop engineering talent will be critical.\n\nYour responsibilities: \n - Partnering with the cross-functional GPC team, implement the strategy and roadmap for modernizing digital e-commerce platforms\n - Implement the technology platforms architecture and execute on a roadmap to support build out the new commerce-related capabilities needed for the unified commerce strategy\n - Responsible for delivery and support of the Platform\n - Responsible for simplifying the complexity of current platforms and reducing the technical debt and optimal total cost of ownership\n - Partner with peer leaders to accelerate and embed agile methodologies across the organization to increase customer-backed problem-solving, increase pace of solution delivery, accelerate innovation, and to enhance cross-functional collaboration\n - Recruit, manage, and motivate a team of engineers to develop best-in-class solutions\n\nOur requirements: \n - 10+ years’ experience working in software development\n - 5+ years of leading technology teams\n - Proven track record of building technology development teams a must\n - Experience working across multiple time zones\n - A broad understanding of IT principles, frameworks and methodologies including TOGAF, Agile, Scrum, DevOps, ITIL with extensive experience planning and managing complex technology projects utilising these methodologies\n - A Comprehensive understanding of cloud technologies, AWS a must\n - Proficient in DevOps practices\n - Experience across Java script frontend technologies, SAP Hybris and Commerce tools\n - 10+ years working in complex eCommerce organisations\n - A passion for innovation, technology, and digital transformation\n - Strong leadership capability demonstrated through previous experience leading IT teams, where you have motivated and cultivated a team of professionals\n - Passion for eCommerce and Digital solutions\n\n\n\nBenefits: \n - sharing the costs of sports activities\n - private medical care\n - sharing the costs of professional training & courses\n - life insurance\n - coffee / tea\n - meal passes\n - sharing the commuting costs\n - extra leave\n - work in international teams\n - friendly atmosphere\n - copyrights for IT roles\n - hybrid work\n\n"
    },
    "source": "https://theprotocol.it/filtry/javascript;t/praca/engineering-manager-javascript-sap-hybris-krakow-lubicz-23a,oferta,e5b40000-cd64-8629-53a9-08dcf1d8c43f?s=5358332323&searchId=70e16510-9c6e-11ef-9133-9dd9082db450",
    "timestamp": "2024-11-06T18:56:17.665Z"
  }