{
    "offer": {
      "offer_title": "Freelance Senior RoR Developer with JS",
      "company": "NETGURU S.A.",
      "salary": " salary not specified ",
      "contract": "B2B contract (full-time)",
      "location": "remote work - Набір відкритий для українців",
      "experience": "senior",
      "expected_technologies": "Ruby on Rails, JavaScript",
      "optional_technologies": "N/A",
      "offer_content": "\nYour responsibilities: \nWe are looking for Senior RoR Developer with JS and experience with email technologies like Mailgun or SparkPost.\nRequired skills: Ruby on Rails, JavaScript, email technologies.\nWe offer: 100% remote work, flextime & flexplace, dev-friendly processes, long-term collaboration.\nFreelance assignment: full-time, 6-months, B2B contract, CET (+1/-1) working hours\n\nOur requirements: \n - At least 5 years' experience and advanced knowledge of Ruby and Ruby on Rails development.\n - Solid basics of JavaScript (experience with Ember.js would be beneficial).\n - Experience with email technologies like Mailgun or SparkPost would be beneficial.\n - Highly developed communication skills required.\n - Worked closely with clients and maintained positive relationships with them.\n - A high sense of responsibility and accountability for work.\n - Strong problem solving skills, curiosity to dig deep, debug and solve issues.\n - An attitude not just to ship small patches, but finding the root cause and fixing them.\n - Knowledge of English (C1), spoken and written.\n\nWhat we offer: \n - Flexibility: 100% remote work.\n - Professionality: dev-friendly processes, like Continuous Integration and Code Review, work in line with Agile methodology.\n - Diversity: projects from various industries like fintech, healthcare, insurance, or education.\n - Growth: work with a team of experts and continuous development of your hard and soft skills.\n - Knowledge: knowledge sharing sessions, internal knowledge base.\n\n"
    },
    "source": "https://theprotocol.it/filtry/javascript;t/praca/freelance-senior-ror-developer-with-js-poznan-male-garbary-9,oferta,26860000-3255-4a51-f607-08dce7688bb9?s=5358332323&searchId=70e16510-9c6e-11ef-9133-9dd9082db450",
    "timestamp": "2024-11-06T19:50:37.240Z"
  }