{
    "offer": {
      "offer_title": "Lead Software Engineer (Python)",
      "company": "GPC GLOBAL TECHNOLOGY CENTER",
      "salary": " salary not specified ",
      "contract": "contract of employment (full-time)",
      "location": "hybrid work - Kraków, Grzegórzki",
      "experience": "mid",
      "expected_technologies": "Python",
      "optional_technologies": "N/A",
      "offer_content": "\nAbout the project: \nWe are seeking an innovative and hands-on Engineering Tech Lead to join our team, focusing on the exploration and implementation of Generative AI and other innovative new technologies. The ideal candidate will have a unique blend of leadership, technical expertise, and a passion for new technology. Your role will be central to understanding the applicability of Generative AI for our company's unique use cases, and you will be instrumental in bringing Cloud solutions from development to production.\n\nYour responsibilities: \n - Technical Leadership:\n - Lead and mentor a talented technical team, fostering a culture of innovation and continuous learning.\n - Write, review, and maintain code while ensuring alignment with best practices and project goals.\n - Design and whiteboard solutions, collaborating with the team to develop and implement innovative approaches.\n - Generative AI Exploration:\n - Investigate and apply Generative AI methodologies to meet the company's specific needs and challenges.\n - Collaborate with cross-functional teams to determine the best applications of Generative AI for the business.\n - Cloud Solutions Development:\n - Spearhead the implementation of Cloud solutions, specifically on the Google Cloud Platform (GCP) and Vertex AI.\n - Guide the full lifecycle of development, from initial design to production deployment, ensuring quality and efficiency.\n - Data and Machine Learning:\n - Utilize experience with data analytics to provide insights and drive decision-making.\n - Build and deploy machine learning models, working with the team to optimize and scale as needed.\n - Continuous Learning and Improvement:\n - Stay abreast of emerging technologies and industry trends to continually evolve the team's capabilities.\n - Foster a culture of curiosity and learning, encouraging experimentation and growth.\n\nOur requirements: \n - Bachelor’s degree in Computer Science, Engineering, or related field.\n - Minimum of 4-5 years of experience in technical leadership, with a strong focus on Cloud solutions and development-to-production lifecycle.\n - Passion for learning and applying new technologies, with the ability to inspire and drive innovation within the team.\n - Excellent communication, collaboration, and problem-solving skills.\n - Extensive hands-on experience deploying scalable cloud-based solutions.\n - Proficient in Google Cloud Platform (GCP), particularly in leveraging services like Vertex AI and other GCP offerings to build, deploy, and manage robust data-driven solutions.\n - Experience with Generative AI is a major plus.\n\n\n\nBenefits: \n - sharing the costs of sports activities\n - private medical care\n - sharing the costs of professional training & courses\n - life insurance\n - coffee / tea\n - meal passes\n - sharing the commuting costs\n - extra leave\n - work in international teams\n - friendly atmosphere\n - copyrights for IT roles\n - hybrid work\n\n"
    },
    "source": "https://theprotocol.it/filtry/python;t/praca/lead-software-engineer-python-krakow-lubicz-23a,oferta,76170000-8721-cec2-4509-08dce6d0e13a?s=-684638444&searchId=70e16510-9c6e-11ef-9133-9dd9082db450",
    "timestamp": "2024-11-06T19:51:23.872Z"
  }