{
    "offer": {
      "offer_title": "Python Developer",
      "company": "HSBC Service Delivery (Polska) Sp. z o.o.",
      "salary": " salary not specified ",
      "contract": "contract of employment (full-time)",
      "location": "hybrid work - Набір відкритий для українців",
      "experience": "mid • senior",
      "expected_technologies": "C++, Java, C#, Python",
      "optional_technologies": "N/A",
      "offer_content": "\nAbout the project: \nSome careers shine brighter than others.\nIf you’re looking for a career that will help you stand out, join HSBC, and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.\nYour career opportunity\nAs Python Developer you will contribute to all aspects of programming work—within potentially several prototyping teams — in the construction and testing of analytic platforms. You will play a key role in accelerating development of prototypes that could materially influence the process of risk analysis and risk measurement at HSBC. New platforms and methods created by Financial Engineering Business Unit will substantially improve the consistency of risk model development across HSBC, streamline the operational profile of model development projects (reducing costs and time) and reduce the risk of project failure, and dramatically improve the model deployment process.\n\nYour responsibilities: \n - Collaborate with other developers, data analysts and modellers and actively contribute to decision-making process in order to manage software development lifecycle.\n - Actively utilise tried and tested methods for managing the development of software.\n - Comply with the standard FIM requirements and act to minimize all aspects of operational risk such as it pertains to their role.\n - Maintain HSBC internal control standards, including timely implementation of internal and external audit points together with any issues raised by external regulators.\n - Maintenance of technical documentation throughout prototyping and core development processes.\n - Engagement with stakeholders during delivery.\n\nOur requirements: \n - MSc or PhD in a technical field such as Computer Science, Mathematics, Physics, Operational Research and/or Information Systems (Informatics) or similar.\n - Demonstrated 3 years of experience building, and testing applications in a professional environment.\n - Solid experience developing applications using an object oriented programming language (e.g. Java, C++, C# or Python).\n - Some experience programming in a mathematical or engineering technical environment (such as MATLAB).\n - Knowledge of the more common design patterns.\n - Strong knowledge of testing principles.\n - Some experience developing in an Agile environment with preferably some experience with continuous integration practices.\n - Familiarity with algorithms for capturing and processing large datasets (i.e. Map/Reduce).\n - Some knowledge of machine learning and pattern recognition techniques.\n - Experience working with non-traditional database architectures (such as column free / NoSQL / graph-theoretic structures).\n\n\nWhat we offer: \n - Competitive salary\n - Annual performance-based bonus\n - Additional bonuses for recognition awards\n - Multisport card\n - Private medical care\n - Life insurance\n - One-time reimbursement of home office set-up (up to 800 PLN). Corporate parties & events\n - CSR initiatives\n - Nursery discounts\n - Financial support with trainings and education\n - Social fund\n - Flexible working hours\n - Free parking\n\nBenefits: \n - sharing the costs of sports activities\n - private medical care\n - sharing the costs of professional training & courses\n - life insurance\n - remote work opportunities\n - flexible working time\n - integration events\n - corporate sports team\n - doctor’s duty hours in the office\n - retirement pension plan\n - corporate library\n - no dress code\n - coffee / tea\n - parking space for employees\n - leisure zone\n - extra social benefits\n - employee referral program\n - opportunity to obtain permits and licenses\n - charity initiatives\n - family picnics\n - extra leave\n - In-office gym\n\n"
    },
    "source": "https://theprotocol.it/filtry/python;t/praca/python-developer-krakow-kapelanka-42a,oferta,f7950000-bac4-def7-e3f0-08dcfe35a716?s=-684638444&searchId=70e16510-9c6e-11ef-9133-9dd9082db450",
    "timestamp": "2024-11-06T19:51:40.552Z"
  }